In [1]:
import pandas as pd
import numpy as np
dict={'name':['abi','ashu',np.nan,'haru'],
     'regno':[np.nan,'2','4','5']}
df=pd.DataFrame(dict)
print(df)

   name regno
0   abi   NaN
1  ashu     2
2   NaN     4
3  haru     5

In [2]:
df

   name regno
0   abi   NaN
1  ashu     2
2   NaN     4
3  haru     5

In [3]:
df.isnull()

    name  regno
0  False   True
1  False  False
2   True  False
3  False  False

In [4]:
df.notnull()

    name  regno
0   True  False
1   True   True
2  False   True
3   True   True

In [5]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [6]:
df.fillna(3)

   name regno
0   abi     3
1  ashu     2
2     3     4
3  haru     5

In [7]:
df.replace(3,5)

   name regno
0   abi   NaN
1  ashu     2
2   NaN     4
3  haru     5

In [9]:
df.interpolate

<bound method DataFrame.interpolate of    name regno
0   abi   NaN
1  ashu     2
2   NaN     4
3  haru     5>